Tekla Open API Reference for Tekla Structures 2025
BaseLinePlacing Class
 The BaseLinePlacing class defines a placing where the object is placed using a line as a reference. This will thus define the object's X-axis along that line.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PlacingBase
 Tekla.Structures.Drawing.BaseLinePlacing
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class BaseLinePlacing : PlacingBase
<SerializableAttribute>
Public Class BaseLinePlacing
	Inherits PlacingBase
The BaseLinePlacing type exposes the following members.
Constructors
Name | Description
BaseLinePlacing
 Creates a new base line placing instance. The given two points define the line to be used for the placing.
Top
Properties
Name | Description
EndPoint
 Sets the end point of the line that the object is using for the placement.
StartPoint
 Sets the start point of the line that the object is using for the placement.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides PlacingBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace